# frozen_string_literal: true
# vim: filetype=ruby

# This handles installing software using Homebrew via it's built-in `brew bundle` command.
# For more information on how to write a `Brewfile` file, check out the following page:
# https://github.com/Homebrew/homebrew-bundle?tab=readme-ov-file

# At a high-level:
#
# - A `formula` is what is generally available via `brew install`.
# - A `cask` is an application distributed in binary form (e.g. Firefox, Alacritty, etc).
# - A `tap` is a git repo containing multiple formulae/casks
# 
# As a general rule of thumb, setup taps first so that you can then access
# formulae/casks that might not be available otherwise.
#
# For more information on Homebrew concepts such as formula, kegs, etc check out the following page:
# https://kb.novaordis.com/index.php/Brew_Concepts
def work?
  @work ||= ENV.fetch("WORK_LAPTOP", "true").downcase == "true"
end

# 'brew tap'
tap "charmbracelet/tap"

# 'brew install'
brew "atuin"
brew "awscli"
brew "cargo-binstall"
brew "charmbracelet/tap/freeze"
brew "diff-so-fancy"
brew "docker" unless work?
brew "duckdb"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "gum"
brew "jq"
brew "lazygit"
brew "libpq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "subversion"
brew "tealdeer"
brew "terraform" unless work?
brew "tmux"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"

# 'brew install --cask'
cask "1password-cli"
cask "cloudflare-warp" unless work?
cask "discord" unless work?
cask "firefox"
cask "kitty"
cask "notion" unless work?
cask "obsidian"
cask "rectangle"
cask "slack"
cask "spotify"
cask "zen"
cask "zoom" unless work?

# Depend on `homebrew/cask-fonts`
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
