# Applications
# Google Chrome - Web browser
# cask "google-chrome"
# Discord - Voice and text chat software
cask "discord"
# iTerm2 - macOS Terminmal Replacement
cask "iterm2"
# Docker - Pack, ship and run any application as a lightweight container
# cask "docker"
# Rectangle - Move and resize windows in macOS using keyboard shortcuts or snap areas
cask "rectangle"
cask "firefox"
cask "slack"
cask "notion"
cask "authy"

# Fonts
tap "homebrew/cask-fonts"
# subversion - Version control system designed to be a better CVS
# (required for the font installation)
# Requirements for -- well, living
brew "svn"
brew "git"
brew "neovim"
brew "tmux"
brew "stow"
brew "jq"

# Environment specific tools
brew "awscli"
brew "asdf"
brew "tealdeer"
brew "direnv"
brew "ripgrep"
brew "gh"
brew "terraform"
brew "postgresql"
